### Problem 1:
 Load the Titanic dataset from file ‒ Using the
Titanic dataset (titanic_rev.csv) that is uploaded on the LMS.
Print the dimension of the dataset.

In [6]:
import pandas as pd
import os
current_dir = os.getcwd()
arr = pd.read_csv(current_dir + '/2025/Data_Science/titanic_rev.csv')
arr.shape

(891, 12)

### Problem 2:
Print how many non-null values there are in
each column

In [8]:
arr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          712 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Problem 3:
 Replace the NA value in "Age" column with the
mean of “Age”. Then, print the first five rows.

In [9]:
arr.fillna(arr['Age'].mean(), inplace=True)
arr.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,29.741812,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,29.741812,0,0,STON/O2. 3101282,7.9250,29.741812,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,29.741812,S

### Problem 4:
 Remove the ‘Cabin’ column. Then, print the
column labels. Save the df column with removing Cabin
for next problem.

In [12]:
df = arr.drop(columns=['Cabin'])
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

### Problem 5:
 Remove the rows that have a NA value in the
"Embarked" column. Then, print the dimensionality of the
DataFrame.

In [17]:
df2 = df.dropna(subset=['Embarked'])
df2.shape

(891, 11)

### Problem 6:
Print the unique values of ‘Sex’ Column first.
Then, change the value format of the 'Sex' column to use
only 'female' or 'male'. Then print the count of unique
values in the 'Sex' column.

In [22]:
df2['Sex'].unique()
df2['Sex'].replace({'M': 'male', 'Female': 'female', 'Male': 'male', 'F': 'female', 'male': 'male', 'female': 'female'}, inplace=True)
df2['Sex'].value_counts()

Sex
male      578
female    313
Name: count, dtype: int64

### Problem 7:
 Find outliers in the “Fare” column using the
InterQuartile Range (IQR) method. At first print Q1, Q3
and IQR of “Fare” columns. And then print only the rows
corresponding to the outliers.

In [26]:
Q1 = df2['Fare'].quantile(0.25)
Q3 = df2['Fare'].quantile(0.75)
IQR = Q3 - Q1
print(f'Q1: {Q1}, Q3: {Q3}, IQR: {IQR}')
lower = Q1- 1.5 * IQR
upper = Q3 + 1.5 * IQR
outliers = df2[(df2['Fare'] < lower) | (df2['Fare'] > upper)]
print(outliers)

Q1: 7.9104, Q3: 31.275, IQR: 23.3646
     PassengerId  Survived  Pclass  \
1              2         1       1
27            28         0       1
31            32         1       1
34            35         0       1
52            53         1       1
..           ...       ...     ...
846          847         0       3
849          850         1       1
856          857         1       1
863          864         0       3
879          880         1       1

                                                  Name     Sex        Age  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.000000
27                      Fortune, Mr. Charles Alexander    male  19.000000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  female  29.741812
34                             Meyer, Mr. Edgar Joseph    male  28.000000
52            Harper, Mrs. Henry Sleeper (Myna Haxtun)  female  49.000000
..                                                 ...     ...        ...
846                           Sage, Mr. Douglas Bullen    male  29.741812
849       Goldenberg, Mrs. Samuel L (Edwiga Grabowska)  female  29.741812
856         Wick, Mrs. George Dennick (Mary Hitchcock)  female  45.000000
863                  Sage, Miss. Dorothy Edith "Dolly"  female  29.741812
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.000000

     SibSp  Parch    Ticket      Fare Embarked
1        1      0  PC 17599   71.2833        C
27       3      2     19950  263.0000        S
31       1      0  PC 17569  146.5208        C
34       1      0  PC 17604   82.1708        C
52       1      0  PC 17572   76.7292        C
..     ...    ...       ...       ...      ...
846      8      2  CA. 2343   69.5500        S
849      1      0     17453   89.1042        C
856      1      1     36928  164.8667        S
863      8      2  CA. 2343   69.5500        S
879      0      1     11767   83.1583        C

[118 rows x 11 columns]